Revit 2027 API
ProjectLocationSet Class
An set that contains project locations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ProjectLocationSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProjectLocationSet : APIObject,
	IEnumerable
Public Class ProjectLocationSet
	Inherits APIObject
	Implements IEnumerable
public ref class ProjectLocationSet : public APIObject,
	IEnumerable
type ProjectLocationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The ProjectLocationSet type exposes the following members.
Constructors
Name | Description
ProjectLocationSet | Initializes a new instance of the ProjectLocationSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of project locations that are in the set.
Top
Methods
Name | Description
Clear | Removes every project location from the set, rendering it empty.
Contains | Tests for the existence of a project location within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified project location from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified project location into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace